import numpy as np
import matplotlib.pyplot as plt

## ΛΙΣΤΕΣ ΠΟΥ ΘΑ ΧΡΕΙΑΣΤΟΥΝ ΣΤΟ ΠΡΟΓΡΑΜΜΑ ##
############################################

Foods=["Κοτόπουλο","Τυρί","Ρύζι"] #ΕΙδη Τροφών
Cost=[0.005, 0.01, 0.003] #Κόστος για κάθε Είδος Τροφής ανα γραμμάριο (Σύμφωνα με την προαναφερόμενη σειρά)
Ingredients=["Πρωτείνες","Υδατάνθρακες","Λιπαρά"] #Είδη Θρεπτικών Συστατικών
I1=[0.27,0.15,0.03] # Ποσσότητα προτείνης σε κάθε γραμμάριο των τριών τροφών (Σύμφωνα με την προαναφερόμενη σειρά)
I2=[0.01,0.02,0.28] # Ποσσότητα υδατάνθρακα σε κάθε γραμμάριο των τριών τροφών (Σύμφωνα με την προαναφερόμενη σειρά)
I3=[0.04,0.2,0.01] # Ποσσότητα λιπαρών σε κάθε γραμμάριο των τριών τροφών (Σύμφωνα με την προαναφερόμενη σειρά)
Daily_Consumption=[[90,150,60]] # Συνηστώμενη ημερίσια ποσσότητα σε γραμμάρια για κάθε Θρεπτικό Συστατικό (Σύμφωνα με την προαναφερόμενη σειρά)
Discount=[0.05, 0.1, 0.15]# Ποσσόστο έκπτωσης ανά κατάστημα


## MAIN ΠΡΟΓΡΑΜΜΑ ##
####################

#Υπολογισμός απαραίτητης ποσσότητας από κάθε τροφή ημερισίως

#δημιουργία ενός numpy array απο την λίστα Daily_Consumption
B = np.array(Daily_Consumption)
#δημιουργία του A το οποίο είναι λίστα με τις λίστες των ποσοτίτων θρεπτικών συστατικών
A = [I1, I2, I3]

#χρήση της linalg.solve με όρισμα το A και το .transpose του B για να βρουμε το Q
#το οποίο είναι η ημερήσια ποσότητα κάθε φαγητού που χρειαζόμαστε
Q = np.linalg.solve(A,B.transpose())

#επανάληψη πάνω στο Q κάνοντας type casting σε float καθε τιμή οπου βρίσκουμε με format 2 αριθμούς μετά την υποδιαστολή
#το χρήση του food_index για να τυπωθεί το σωστό φαγητό παράλληλα, σε κάθε επανάληψη αυξάνεται το food_index κατα 1
food_index = 0 
for i in Q:
    print(f"Θα αγοραστούν {float(i):.2f} γραμμάρια {Foods[food_index]}.")
    food_index += 1


# Υπολογισμός συνολικού κόστους και κόστους ανά τροφή

# χρήση της .miltiply με όρισμα το Cost και το .transpose του Q για να πάρουμε το κόστος για την αγορά κάθε μίας από τις τροφές
# χρήση της .sum στο ήδη multiplied πίνακα για να πάρουμε το συνολικό κόστος της συνιστώμενης διατροφής 
each_food_cost = np.multiply(Cost, Q.transpose())
total_cost = np.sum(each_food_cost)
#τύπωμα των κόστων
print(f"Το συνολικό κόστος είναι {total_cost:.2f} ευρώ.")
for array in each_food_cost:
    for index, obj in enumerate(array):
        print(f"Θα χρειαστούν {obj:.2f} ευρώ για αγορά {Foods[index]}")

#Υπολογισμός έκπτωσης
#επανάληψη πάνω στα στοιχεία του Discount, υπολογισμός της κάθε τιμής του total_cost με το εκάστοτε discount και τυπωμά τους
for discount in Discount:
    print(f"Με έκπτωση {int(100*discount)}% το κόστος θα είναι {total_cost-(total_cost*discount):.2f} ευρώ.")


#Γραφική Παράσταση κόστους σε συνάρτηση με ποιότητα κοτόπουλου
cost_sens=[4.701010101010101, 4.687575722046352, 4.674992431123221, 4.663181834855655, 4.652074880774432, 4.641610506307241, 4.63173451565229, 4.622398640922604, 4.613559753227755, 4.605179196481119]
A_sens=[0.27, 0.2781, 0.2862, 0.29430000000000006, 0.30240000000000006, 0.3105, 0.3186, 0.3267, 0.33480000000000004, 0.34290000000000004]

# Χρήση της .plot με όρισμα στον x άξονα τα ποσοστά πρωτείνης στο κοτόπουλο και y άξονα το συνολικό κόστος τροφίμων
plt.plot(A_sens, cost_sens)
plt.xlabel("Ποσοστό πρωτείνης στο κοτόπουλο")
plt.ylabel("Συνολικό κόστος τροφών")
plt.show()
