import sys
while (True):
    j = (True) 
    while (j): 
        amka = input("\nΔώστε το ΑΜΚΑ σας: ")
        if (len(amka) == 11 and amka.isdigit()): #συνθηκη για 11 ακεραια ψηφια
            j =(False) #φευγει απο αυτη την while και συνεχιζει το προγραμμα
        else: #σε οποιαδηποτε αλλη περιπτωση ξαναζηταει να δωσεις ΑΜΚΑ
            print("\nΜη έγκυρο ΑΜΚΑ\n")
    if(22 - int(amka[4:6]) < 0): #συνθηκη για to αν ειναι πριν του 2000 ο χρηστης
        print("\nΗλικία:",22 - int(amka[4:6]) + 100),"ετών."#αν ειναι πριν το 2000 προσθετει 100 στο αποτελεσμα
    else: #αν οχι κανει print χωρις να προσθετει 100
        print("\nΗλικία:",22 - int(amka[4:6]),"ετών.")
    if(int(amka[9]) % 2 == 0): #συνθηκη για το αν ειναι αρτιος η περιττος ο αριθμος
        print("Φύλο: Γυναίκα.\n")
    else: #σε οποιαδηποτε αλλη περιπτωση(να μην ειναι αρτιος)
        print("Φύλο: Άνδρας.\n")
    u = (True)
    while (u):
        retry = input ("Αν θέλετε να επαναλάβετε πατήστε Ν για ναι,αλλιώς πατήστε Ο για όχι: ")
        if (retry.capitalize() == "Ν"): #συνθηκη για αν το κεφαλαιο συμβολο
                                        #της μεταβλητης retry ειναι το ελληνικο Ν
            u = (False) #φευγει απο αυτη την while και ξεκιναει παλι απο την αρχη
        elif (retry.capitalize()) == ("Ο"): #συνθηκη για αν το κεφαλαιο συμβολο
                                            #της μεταβλητης retry ειναι το ελληνικο Ο
            sys.exit() #κλεινει το προγραμμα
            
    
        
    
            
